// Git - система контроля версий.
// Он позволяет:
// - отслеживать изменения в файлах;
// - работать над одним проектом нескольким разработчикам не мешая друг другу;
// - и др.

// GitHub - облачное храгилище проектов (онлайн-хостинг репозиториев).
// Он позволяет:
// - размещать проекты в облачном хранилище;
// - делиться написанным кодом с другими разработчиками;
// - ограничивать доступ к проекту;
// - и др.

// Команды

// git--version - узнать установленную версию Git.
// git clone [URL с Github] - клонирует репозиторий с Github на локальный компьютер.
// ls - показывает файлы и папки внутри локального репозитория.
// ls -a - показывает все файлы и папки (включая скрытые )внутри локального репозитория.
// clear - очистить консоль терминала.
// git init - инициализирует локальный репозиторий.
// git remote -v - проверяет привязку между локальным репозиторием и удаленным репозиториеями.
// git remote add origin [URL с Github] - осуществляет привязку между локальным и удаленным репозиториеями.
// git config user.name - показывает имя разработчика.
// git config user.email - показывает электронную почту разработчика.
// git status - отслеживает изменения в файлах.
// git add [название изменных файлов] - подготавливает файлы к записи и добавляет их в stage-area выборочно.
// git add . - подготавливает все файлы к записи и добавляет их stage-area.
// git commit - записывает подготовленные файлы.
// git commit -m "comment"- записывает подготовленные файлы с комментарием.
// git log - просмотр списка сделанных записей.
// git log --oneline - просмотр списка сделанных записей в укороченном виде.
// git push [ссылка на репозиторий] [имя ветки] - отправка изменений на удаленный репозиторий.